RT-Thread/rt-thread/bsp/stm32/libraries/STM32H7RSxx_HAL/STM32H7RSxx_HAL_Driver/Src/stm32h7rsxx_hal_mdf.c
/**
  ******************************************************************************
  * @file    stm32h7rsxx_hal_mdf.c
  * @author  MCD Application Team
  * @brief   This file provides firmware functions to manage the following
  *          functionalities of the Multi-function Digital Filter (MDF)
  *          peripheral:
  *           + Initialization and de-initialization
  *           + Acquisition
  *           + Clock absence detection
  *
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2022 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  @verbatim
  ==============================================================================
                     ##### How to use this driver #####
  ==============================================================================
  [..]
    *** Initialization and de-initialization ***
    ============================================
    [..]
      (#) User has first to initialize ADF instance.
      (#) As prerequisite, fill in the HAL_MDF_MspInit() :
        (++) Enable ADFz clock interface with __HAL_RCC_ADFz_CLK_ENABLE().
        (++) Enable the clocks for the used GPIOS with __HAL_RCC_GPIOx_CLK_ENABLE().
        (++) Configure these pins in alternate mode using HAL_GPIO_Init().
        (++) If interrupt mode is used, enable and configure ADFz_FLTx
             interrupt with HAL_NVIC_SetPriority() and HAL_NVIC_EnableIRQ().
        (++) If DMA mode is used, initialize and configure DMA.
      (#) Configure the common parameters, serial interface parameters and
          filter bitstream selection by calling HAL_MDF_Init() function.

    [..]
      (#) User can de-initialize ADF instance with HAL_MDF_DeInit() function.

    *** Acquisition ***
    ===================
    [..]
      (#) Configure filter parameters and start acquisition using HAL_MDF_AcqStart(),
          HAL_MDF_AcqStart_IT() or HAL_MDF_AcqStart_DMA().
      (#) In polling mode :
            (++) Use HAL_MDF_PollForAcq() to detect the end of acquisition.
                 Use HAL_MDF_GetAcqValue to get acquisition value.
            (++) Use HAL_MDF_PollForSndLvl() to detect and get
                 new sound level value and ambient noise value.
            (++) Use HAL_MDF_PollForSad() to detect sound activity.
      (#) In interrupt mode :
            (++) HAL_MDF_AcqCpltCallback() will be called at the end of acquisition.
                 Use HAL_MDF_GetAcqValue to get acquisition value.
            (++) HAL_MDF_SndLvlCallback() will be called when new
                 sound level and ambient noise values are available.
            (++) HAL_MDF_SadCallback() will be called when
                 sound activity detection occurs.
            (++) HAL_MDF_ErrorCallback() will be called if overflow, filter overrun or
                 saturation occurs.
                 Use HAL_MDF_GetErrorCode() to get the corresponding error.
      (#) In DMA mode :
            (++) HAL_MDF_AcqHalfCpltCallback() and HAL_MDF_AcqCpltCallback() will be called
                 respectively at the half acquisition and at the acquisition complete.
            (++) HAL_MDF_SndLvlCallback() will be called when new
                 sound level and ambient noise values are available.
            (++) HAL_MDF_SadCallback() will be called when
                 sound activity detection occurs.
            (++) HAL_MDF_ErrorCallback() will be called if overflow, filter overrun,
                 saturation or DMA error occurs.
                 Use HAL_MDF_GetErrorCode() to get the corresponding error.
      (#) Use HAL_MDF_GenerateTrgo() to generate pulse on TRGO signal.
      (#) During acquisition, use HAL_MDF_SetDelay() and HAL_MDF_GetDelay() to respectively
          set and get the delay on data source.
      (#) During acquisition, use HAL_MDF_SetGain() and HAL_MDF_GetGain() to respectively
          set and get the filter gain.
      (#) Stop acquisition using HAL_MDF_AcqStop(), HAL_MDF_AcqStop_IT() or HAL_MDF_AcqStop_DMA().

    *** Clock absence detection ***
    ===============================
    [..]
      (#) Clock absence detection is always enabled so no need to start clock absence detection
          in polling mode.
          Use HAL_MDF_CkabStart_IT() to start clock absence detection in interrupt mode.
      (#) In polling mode, use HAL_MDF_PollForCkab() to detect the clock absence.
      (#) In interrupt mode, HAL_MDF_ErrorCallback() will be called if clock absence detection
          occurs.
          Use HAL_MDF_GetErrorCode() to get the corresponding error.
      (#) Stop clock absence detection in interrupt mode using HAL_MDF_CkabStop_IT().

    *** generic functions ***
    =========================
    [..]
      (#) HAL_MDF_IRQHandler will be called when ADF interrupt occurs.
      (#) HAL_MDF_ErrorCallback will be called when ADF error occurs.
      (#) Use HAL_MDF_GetState() to get the current ADF instance state.
      (#) Use HAL_MDF_GetErrorCode() to get the current ADF instance error code.

    *** Callback registration ***
    =============================
    [..]
    The compilation define USE_HAL_MDF_REGISTER_CALLBACKS when set to 1
    allows the user to configure dynamically the driver callbacks.
    Use functions HAL_MDF_RegisterCallback(), HAL_MDF_RegisterOldCallback()
    or HAL_MDF_RegisterSndLvlCallback() to register a user callback.

    [..]
    Function HAL_MDF_RegisterCallback() allows to register following callbacks :
      (+) AcqCpltCallback     : Acquisition complete callback.
      (+) AcqHalfCpltCallback : Acquisition half complete callback.
      (+) SadCallback         : Sound activity detection callback (only for ADF instance).
      (+) ErrorCallback       : Error callback.
      (+) MspInitCallback     : MSP init callback.
      (+) MspDeInitCallback   : MSP de-init callback.
    [..]
    This function takes as parameters the HAL peripheral handle, the Callback ID
    and a pointer to the user callback function.

