RT-Thread/rt-thread/bsp/stm32/libraries/STM32H7RSxx_HAL/STM32H7RSxx_HAL_Driver/Src/stm32h7rsxx_hal_mdf.c
    [..]
    For specific sound level callback use dedicated register callback :
    HAL_MDF_RegisterSndLvlCallback().

    [..]
    Use function HAL_MDF_UnRegisterCallback() to reset a callback to the default weak function.

    [..]
    HAL_MDF_UnRegisterCallback() takes as parameters the HAL peripheral handle and the Callback ID.
    [..]
    This function allows to reset following callbacks :
      (+) AcqCpltCallback     : Acquisition complete callback.
      (+) AcqHalfCpltCallback : Acquisition half complete callback.
      (+) SadCallback         : Sound activity detection callback (only for ADF instance).
      (+) ErrorCallback       : Error callback.
      (+) MspInitCallback     : MSP init callback.
      (+) MspDeInitCallback   : MSP de-init callback.

    [..]
    For specific sound level callback use dedicated unregister callback :
    HAL_MDF_UnRegisterSndLvlCallback().

    [..]
    By default, after the call of init function and if the state is RESET
    all callbacks are reset to the corresponding legacy weak functions :
    examples HAL_MDF_AcqCpltCallback(), HAL_MDF_ErrorCallback().
    Exception done for MspInit and MspDeInit callbacks that are respectively
    reset to the legacy weak functions in the init and de-init only when these
    callbacks are null (not registered beforehand).
    If not, MspInit or MspDeInit are not null, the init and de-init keep and use
    the user MspInit/MspDeInit callbacks (registered beforehand).

    [..]
    Callbacks can be registered/unregistered in READY state only.
    Exception done for MspInit/MspDeInit callbacks that can be registered/unregistered
    in READY or RESET state, thus registered (user) MspInit/DeInit callbacks can be used
    during the init/de-init.
    In that case first register the MspInit/MspDeInit user callbacks using
    HAL_MDF_RegisterCallback() before calling init or de-init function.

    [..]
    When the compilation define USE_HAL_MDF_REGISTER_CALLBACKS is set to 0 or
    not defined, the callback registering feature is not available
    and weak callbacks are used.

    @endverbatim
  */

/* Includes ------------------------------------------------------------------*/
#include "stm32h7rsxx_hal.h"

/** @addtogroup STM32H7RSxx_HAL_Driver
  * @{
  */

/** @defgroup MDF MDF
  * @brief MDF HAL module driver
  * @{
  */

#ifdef HAL_MDF_MODULE_ENABLED

/* Private typedef -----------------------------------------------------------*/
/** @defgroup MDF_Private_Typedefs  MDF Private Typedefs
  * @{
  */
/**
  * @}
  */

/* Private define ------------------------------------------------------------*/
/** @defgroup MDF_Private_Constants  MDF Private Constants
  * @{
  */
/**
  * @}
  */

/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/** @defgroup MDF_Private_Variables  MDF Private Variables
  * @{
  */
static MDF_HandleTypeDef *v_mdfHandle = NULL;
/**
  * @}
  */

/* Private function prototypes -----------------------------------------------*/
/** @defgroup MDF_Private_Functions  MDF Private Functions
  * @{
  */
static void     MDF_AcqStart(MDF_HandleTypeDef *const hmdf, const MDF_FilterConfigTypeDef *const pFilterConfig);
static void     MDF_DmaXferCpltCallback(DMA_HandleTypeDef *hdma);
static void     MDF_DmaXferHalfCpltCallback(DMA_HandleTypeDef *hdma);
static void     MDF_DmaErrorCallback(DMA_HandleTypeDef *hdma);
/**
  * @}
  */

/* Exported functions ---------------------------------------------------------*/
/** @defgroup MDF_Exported_Functions  MDF Exported Functions
  * @{
  */

/** @defgroup MDF_Exported_Functions_Group1  Initialization and de-initialization functions
  * @brief    Initialization and de-initialization functions
  *
@verbatim
  ==============================================================================
            ##### Initialization and de-initialization functions #####
  ==============================================================================
    [..]  This section provides functions allowing to :
      (+) Initialize the ADF instance.
      (+) De-initialize the ADF instance.
      (+) Register and unregister callbacks.
@endverbatim
  * @{
  */

/**
  * @brief  Initialize the MDF instance according to the specified parameters
  *         in the MDF_InitTypeDef structure and initialize the associated handle.
  * @param  hmdf MDF handle.
  * @retval HAL status.
  */
HAL_StatusTypeDef HAL_MDF_Init(MDF_HandleTypeDef *hmdf)
{
  HAL_StatusTypeDef status = HAL_OK;

  /* Check MDF handle */
  if (hmdf == NULL)
  {
    status = HAL_ERROR;
  }
  else
  {
    /* Check parameters */
    assert_param(IS_MDF_ALL_INSTANCE(hmdf->Instance));
    assert_param(IS_MDF_FILTER_BITSTREAM(hmdf->Init.FilterBistream));
    assert_param(IS_FUNCTIONAL_STATE(hmdf->Init.SerialInterface.Activation));

    /* Check that instance has not been already initialized */
    if (v_mdfHandle != NULL)
    {
      status = HAL_ERROR;
    }
    else
    {
#if (USE_HAL_MDF_REGISTER_CALLBACKS == 1)
      /* Reset callback pointers to the weak predefined callbacks */
      hmdf->SndLvCallback       = HAL_MDF_SndLvlCallback;
      hmdf->SadCallback         = HAL_MDF_SadCallback;
      hmdf->AcqCpltCallback     = HAL_MDF_AcqCpltCallback;
      hmdf->AcqHalfCpltCallback = HAL_MDF_AcqHalfCpltCallback;
      hmdf->ErrorCallback       = HAL_MDF_ErrorCallback;

      /* Call MDF MSP init function */
      if (hmdf->MspInitCallback == NULL)
      {
        hmdf->MspInitCallback = HAL_MDF_MspInit;
      }
      hmdf->MspInitCallback(hmdf);
#else /* USE_HAL_MDF_REGISTER_CALLBACKS */
      /* Call MDF MSP init function */
      HAL_MDF_MspInit(hmdf);
#endif /* USE_HAL_MDF_REGISTER_CALLBACKS */

      /* Configure common parameters */
      /* Check clock generator status */
      if ((ADF1->CKGCR & MDF_CKGCR_CKGACTIVE) != 0U)
      {
        status = HAL_ERROR;
      }
      else
      {
        /* Configure processing clock divider, output clock divider,
           output clock pins and output clock generation trigger */
        assert_param(IS_MDF_PROC_CLOCK_DIVIDER(hmdf->Init.CommonParam.ProcClockDivider));
        assert_param(IS_FUNCTIONAL_STATE(hmdf->Init.CommonParam.OutputClock.Activation));
        ADF1->CKGCR = 0U;
        ADF1->CKGCR |= ((hmdf->Init.CommonParam.ProcClockDivider - 1U) << MDF_CKGCR_PROCDIV_Pos);
        if (hmdf->Init.CommonParam.OutputClock.Activation == ENABLE)
        {
          assert_param(IS_MDF_OUTPUT_CLOCK_PINS(hmdf->Init.CommonParam.OutputClock.Pins));
          assert_param(IS_MDF_OUTPUT_CLOCK_DIVIDER(hmdf->Init.CommonParam.OutputClock.Divider));
          assert_param(IS_FUNCTIONAL_STATE(hmdf->Init.CommonParam.OutputClock.Trigger.Activation));
          ADF1->CKGCR |= (((hmdf->Init.CommonParam.OutputClock.Divider - 1U) << MDF_CKGCR_CCKDIV_Pos) |
                          hmdf->Init.CommonParam.OutputClock.Pins |
                          (hmdf->Init.CommonParam.OutputClock.Pins >> 4U));
          if (hmdf->Init.CommonParam.OutputClock.Trigger.Activation == ENABLE)
          {
            assert_param(IS_MDF_OUTPUT_CLOCK_TRIGGER_SOURCE(hmdf->Init.CommonParam.OutputClock.Trigger.Source));
            assert_param(IS_MDF_OUTPUT_CLOCK_TRIGGER_EDGE(hmdf->Init.CommonParam.OutputClock.Trigger.Edge));
            ADF1->CKGCR |= (hmdf->Init.CommonParam.OutputClock.Trigger.Source |
                            hmdf->Init.CommonParam.OutputClock.Trigger.Edge |
                            MDF_CKGCR_CKGMOD);
          }
        }

