RT-Thread/rt-thread/bsp/stm32/libraries/STM32H7RSxx_HAL/STM32H7RSxx_HAL_Driver/Src/stm32h7rsxx_hal_mdf.c
    /* Wait for available acquisition value */
    while (((hmdf->Instance->DFLTISR & MDF_DFLTISR_RXNEF) != MDF_DFLTISR_RXNEF) && (status == HAL_OK))
    {
      /* Check the timeout */
      if (Timeout != HAL_MAX_DELAY)
      {
        if (((HAL_GetTick() - tickstart) > Timeout) || (Timeout == 0U))
        {
          status = HAL_TIMEOUT;
        }
      }
    }

    /* Check if data overflow, saturation or reshape filter occurs */
    uint32_t error_flags = (hmdf->Instance->DFLTISR & (MDF_DFLTISR_DOVRF | MDF_DFLTISR_SATF | MDF_DFLTISR_RFOVRF));
    if (error_flags != 0U)
    {
      /* Update error code */
      if ((error_flags & MDF_DFLTISR_DOVRF) == MDF_DFLTISR_DOVRF)
      {
        hmdf->ErrorCode |= MDF_ERROR_ACQUISITION_OVERFLOW;
      }
      if ((error_flags & MDF_DFLTISR_SATF) == MDF_DFLTISR_SATF)
      {
        hmdf->ErrorCode |= MDF_ERROR_SATURATION;
      }
      if ((error_flags & MDF_DFLTISR_RFOVRF) == MDF_DFLTISR_RFOVRF)
      {
        hmdf->ErrorCode |= MDF_ERROR_RSF_OVERRUN;
      }

      /* Clear corresponding flags */
      hmdf->Instance->DFLTISR |= error_flags;

      /* Call error callback */
#if (USE_HAL_MDF_REGISTER_CALLBACKS == 1)
      hmdf->ErrorCallback(hmdf);
#else /* USE_HAL_MDF_REGISTER_CALLBACKS */
      HAL_MDF_ErrorCallback(hmdf);
#endif /* USE_HAL_MDF_REGISTER_CALLBACKS */
    }

    if (status == HAL_OK)
    {
      /* Update state only in asynchronous single shot mode */
      if ((hmdf->Instance->DFLTCR & MDF_DFLTCR_ACQMOD) == MDF_MODE_ASYNC_SINGLE)
      {
        hmdf->State = HAL_MDF_STATE_READY;
      }
    }
  }

  /* Return function status */
  return status;
}

/**
  * @brief  This function allows to get acquisition value.
  * @param  hmdf MDF handle.
  * @param  pValue Acquisition value on 24 MSB.
  * @retval HAL status.
  */
HAL_StatusTypeDef HAL_MDF_GetAcqValue(const MDF_HandleTypeDef *hmdf, int32_t *pValue)
{
  HAL_StatusTypeDef status = HAL_OK;

  /* Check parameters */
  if (pValue == NULL)
  {
    status = HAL_ERROR;
  }
  else
  {
    /* Check state */
    if (hmdf->State != HAL_MDF_STATE_ACQUISITION)
    {
      if (hmdf->State != HAL_MDF_STATE_READY)
      {
        status = HAL_ERROR;
      }
    }
  }

  if (status == HAL_OK)
  {
    /* Get acquisition value */
    *pValue = (int32_t) hmdf->Instance->DFLTDR;
  }

  /* Return function status */
  return status;
}

/**
  * @brief  This function allows to stop acquisition in polling mode.
  * @param  hmdf MDF handle.
  * @retval HAL status.
  */
HAL_StatusTypeDef HAL_MDF_AcqStop(MDF_HandleTypeDef *hmdf)
{
  HAL_StatusTypeDef status = HAL_OK;

  /* Check state */
  if (hmdf->State != HAL_MDF_STATE_ACQUISITION)
  {
    /* Check if state is ready and filter active */
    if (hmdf->State == HAL_MDF_STATE_READY)
    {
      if ((hmdf->Instance->DFLTCR & MDF_DFLTCR_DFLTACTIVE) != MDF_DFLTCR_DFLTACTIVE)
      {
        status = HAL_ERROR;
      }
    }
    else
    {
      status = HAL_ERROR;
    }
  }
  else
  {
    /* Disable sound activity detector if needed */
    if ((hmdf->Instance->SADCR & MDF_SADCR_SADACTIVE) != 0U)
    {
      hmdf->Instance->SADCR &= ~(MDF_SADCR_SADEN);
    }
  }

  if (status == HAL_OK)
  {
    /* Disable filter */
    hmdf->Instance->DFLTCR &= ~(MDF_DFLTCR_DFLTEN);

    /* Clear all potential pending flags */
    hmdf->Instance->DFLTISR |= (MDF_DFLTISR_DOVRF | MDF_DFLTISR_SATF | MDF_DFLTISR_RFOVRF |
                                MDF_DFLTISR_SDDETF | MDF_DFLTISR_SDLVLF);

    /* Update state */
    hmdf->State = HAL_MDF_STATE_READY;
  }

  /* Return function status */
  return status;
}

/**
  * @brief  This function allows to start acquisition in interrupt mode.
  * @param  hmdf MDF handle.
  * @param  pFilterConfig Filter configuration parameters.
  * @retval HAL status.
  */
HAL_StatusTypeDef HAL_MDF_AcqStart_IT(MDF_HandleTypeDef *hmdf, const MDF_FilterConfigTypeDef *pFilterConfig)
{
  HAL_StatusTypeDef status = HAL_OK;

  /* Check parameters */
  if (pFilterConfig == NULL)
  {
    status = HAL_ERROR;
  }
  else
  {
    assert_param(IS_MDF_ACQUISITION_MODE(pFilterConfig->AcquisitionMode));
    assert_param(IS_FUNCTIONAL_STATE(pFilterConfig->SoundActivity.Activation));
    if ((pFilterConfig->SoundActivity.Activation == ENABLE) &&
        ((pFilterConfig->AcquisitionMode == MDF_MODE_ASYNC_SINGLE) ||
         (pFilterConfig->AcquisitionMode == MDF_MODE_SYNC_SINGLE) ||
         (pFilterConfig->AcquisitionMode == MDF_MODE_WINDOW_CONT)))
    {
      status = HAL_ERROR;
    }
    /* Check state */
    else if (hmdf->State != HAL_MDF_STATE_READY)
    {
      status = HAL_ERROR;
    }
    /* Check filter status */
    else if ((hmdf->Instance->DFLTCR & MDF_DFLTCR_DFLTACTIVE) != 0U)
    {
      status = HAL_ERROR;
    }
    else
    {
      /* Check SAD status */
      if ((hmdf->Instance->SADCR & MDF_SADCR_SADACTIVE) != 0U)
      {
        status = HAL_ERROR;
      }
    }

    if (status == HAL_OK)
    {
      if ((pFilterConfig->SoundActivity.Activation == DISABLE) ||
          (pFilterConfig->SoundActivity.DataMemoryTransfer != MDF_SAD_NO_MEMORY_TRANSFER))
      {
        /* Enable data overflow and fifo threshold interrupts */
        hmdf->Instance->DFLTIER |= (MDF_DFLTIER_DOVRIE | MDF_DFLTIER_FTHIE);
      }

      if (pFilterConfig->ReshapeFilter.Activation == ENABLE)
      {
        /* Enable reshape filter overrun interrupt */
        hmdf->Instance->DFLTIER |= MDF_DFLTIER_RFOVRIE;
      }

      /* Enable saturation interrupt */
      hmdf->Instance->DFLTIER |= MDF_DFLTIER_SATIE;

      if (pFilterConfig->SoundActivity.Activation == ENABLE)
      {
        /* Enable sound level value ready and sound activity detection interrupts */
        assert_param(IS_FUNCTIONAL_STATE(pFilterConfig->SoundActivity.SoundLevelInterrupt));
        hmdf->Instance->DFLTIER |= (pFilterConfig->SoundActivity.SoundLevelInterrupt == ENABLE) ?
                                   (MDF_DFLTIER_SDLVLIE | MDF_DFLTIER_SDDETIE) :
                                   MDF_DFLTIER_SDDETIE;
      }

