RT-Thread/rt-thread/bsp/stm32/libraries/STM32H7RSxx_HAL/STM32H7RSxx_HAL_Driver/Src/stm32h7rsxx_hal_mdf.c
      /* Get ambient noise */
      *pAmbientNoise = hmdf->Instance->SADANLVR;

      /* Clear sound level ready flag */
      hmdf->Instance->DFLTISR |= MDF_DFLTISR_SDLVLF;
    }
  }

  /* Return function status */
  return status;
}

/**
  * @brief  This function allows to poll for sound activity detection.
  * @param  hmdf MDF handle.
  * @param  Timeout Timeout value in milliseconds.
  * @retval HAL status.
  */
HAL_StatusTypeDef HAL_MDF_PollForSad(MDF_HandleTypeDef *hmdf, uint32_t Timeout)
{
  HAL_StatusTypeDef status = HAL_OK;

  /* Check state */
  if (hmdf->State != HAL_MDF_STATE_ACQUISITION)
  {
    status = HAL_ERROR;
  }
  /* Check SAD status */
  else if ((hmdf->Instance->SADCR & MDF_SADCR_SADACTIVE) == 0U)
  {
    status = HAL_ERROR;
  }
  else
  {
    uint32_t tickstart = HAL_GetTick();

    /* Wait for sound activity detection */
    while (((hmdf->Instance->DFLTISR & MDF_DFLTISR_SDDETF) != MDF_DFLTISR_SDDETF) && (status == HAL_OK))
    {
      /* Check the timeout */
      if (Timeout != HAL_MAX_DELAY)
      {
        if (((HAL_GetTick() - tickstart) > Timeout) || (Timeout == 0U))
        {
          status = HAL_TIMEOUT;
        }
      }
    }

    if (status == HAL_OK)
    {
      /* Clear sound activity detection flag */
      hmdf->Instance->DFLTISR |= MDF_DFLTISR_SDDETF;
    }
  }

  /* Return function status */
  return status;
}

/**
  * @brief  MDF acquisition complete callback.
  * @param  hmdf MDF handle.
  * @retval None.
  */
__weak void HAL_MDF_AcqCpltCallback(MDF_HandleTypeDef *hmdf)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hmdf);

  /* NOTE : This function should not be modified, when the function is needed,
            the HAL_MDF_AcqCpltCallback could be implemented in the user file */
}

/**
  * @brief  MDF acquisition half complete callback.
  * @param  hmdf MDF handle.
  * @retval None.
  */
__weak void HAL_MDF_AcqHalfCpltCallback(MDF_HandleTypeDef *hmdf)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hmdf);

  /* NOTE : This function should not be modified, when the function is needed,
            the HAL_MDF_AcqHalfCpltCallback could be implemented in the user file */
}

/**
  * @brief  MDF sound level callback.
  * @param  hmdf MDF handle.
  * @param  SoundLevel Sound level value computed by sound activity detector.
  *         This parameter can be a value between Min_Data = 0 and Max_Data = 32767.
  * @param  AmbientNoise Ambient noise value computed by sound activity detector.
  *         This parameter can be a value between Min_Data = 0 and Max_Data = 32767.
  * @retval None.
  */
__weak void HAL_MDF_SndLvlCallback(MDF_HandleTypeDef *hmdf, uint32_t SoundLevel, uint32_t AmbientNoise)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hmdf);
  UNUSED(SoundLevel);
  UNUSED(AmbientNoise);

  /* NOTE : This function should not be modified, when the function is needed,
            the HAL_MDF_SndLvlCallback could be implemented in the user file */
}

/**
  * @brief  MDF sound activity detector callback.
  * @param  hmdf MDF handle.
  * @retval None.
  */
__weak void HAL_MDF_SadCallback(MDF_HandleTypeDef *hmdf)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hmdf);

  /* NOTE : This function should not be modified, when the function is needed,
            the HAL_MDF_SadCallback could be implemented in the user file */
}

/**
  * @}
  */

/** @defgroup MDF_Exported_Functions_Group3  Clock absence detection functions
  * @brief    Clock absence detection functions
  *
@verbatim
  ==============================================================================
                  ##### Clock absence detection functions #####
  ==============================================================================
    [..]  This section provides functions allowing to :
      (+) Start and stop clock absence detection in interrupt mode.
      (+) Detect clock absence.
@endverbatim
  * @{
  */

/**
  * @brief  This function allows to poll for the clock absence detection.
  * @param  hmdf MDF handle.
  * @param  Timeout Timeout value in milliseconds.
  * @retval HAL status.
  */
HAL_StatusTypeDef HAL_MDF_PollForCkab(MDF_HandleTypeDef *hmdf, uint32_t Timeout)
{
  HAL_StatusTypeDef status = HAL_OK;

  /* Check state */
  if (hmdf->State != HAL_MDF_STATE_ACQUISITION)
  {
    if (hmdf->State != HAL_MDF_STATE_READY)
    {
      status = HAL_ERROR;
    }
  }

  if (status == HAL_OK)
  {
    /* Check serial interface status and mode */
    if ((hmdf->Instance->SITFCR & MDF_SITFCR_SITFACTIVE) == 0U)
    {
      status = HAL_ERROR;
    }
    else
    {
      if ((hmdf->Instance->SITFCR & MDF_SITFCR_SITFMOD) != MDF_SITF_NORMAL_SPI_MODE)
      {
        status = HAL_ERROR;
      }
    }
  }

  if (status == HAL_OK)
  {
    uint32_t tickstart = HAL_GetTick();

    /* Wait for clock absence detection */
    while (((hmdf->Instance->DFLTISR & MDF_DFLTISR_CKABF) != MDF_DFLTISR_CKABF) && (status == HAL_OK))
    {
      /* Check the timeout */
      if (Timeout != HAL_MAX_DELAY)
      {
        if (((HAL_GetTick() - tickstart) > Timeout) || (Timeout == 0U))
        {
          status = HAL_TIMEOUT;
        }
      }
    }

    if (status == HAL_OK)
    {
      /* Clear clock absence detection flag */
      hmdf->Instance->DFLTISR |= MDF_DFLTISR_CKABF;
    }
  }

  /* Return function status */
  return status;
}

/**
  * @brief  This function allows to start clock absence detection in interrupt mode.
  * @param  hmdf MDF handle.
  * @retval HAL status.
  */
HAL_StatusTypeDef HAL_MDF_CkabStart_IT(MDF_HandleTypeDef *hmdf)
{
  HAL_StatusTypeDef status = HAL_OK;

  /* Check state */
  if (hmdf->State != HAL_MDF_STATE_ACQUISITION)
  {
    if (hmdf->State != HAL_MDF_STATE_READY)
    {
      status = HAL_ERROR;
    }
  }

  if (status == HAL_OK)
  {
    /* Check serial interface status and mode */
    if ((hmdf->Instance->SITFCR & MDF_SITFCR_SITFACTIVE) == 0U)
    {
      status = HAL_ERROR;
    }
    else
    {
      if ((hmdf->Instance->SITFCR & MDF_SITFCR_SITFMOD) != MDF_SITF_NORMAL_SPI_MODE)
      {
        status = HAL_ERROR;
      }
    }
  }

  if (status == HAL_OK)
  {
    /* Clear clock absence detection flag */
    hmdf->Instance->DFLTISR |= MDF_DFLTISR_CKABF;

    /* Check clock absence detection flag */
    if ((hmdf->Instance->DFLTISR & MDF_DFLTISR_CKABF) == MDF_DFLTISR_CKABF)
    {
      status = HAL_ERROR;
    }
    else
    {
      /* Enable clock absence detection interrupt */
      hmdf->Instance->DFLTIER |= MDF_DFLTIER_CKABIE;
    }
  }

  /* Return function status */
  return status;
}

/**
  * @brief  This function allows to stop clock absence detection in interrupt mode.
  * @param  hmdf MDF handle.
  * @retval HAL status.
  */
HAL_StatusTypeDef HAL_MDF_CkabStop_IT(MDF_HandleTypeDef *hmdf)
{
  HAL_StatusTypeDef status = HAL_OK;

  /* Check state */
  if (hmdf->State != HAL_MDF_STATE_ACQUISITION)
  {
    if (hmdf->State != HAL_MDF_STATE_READY)
    {
      status = HAL_ERROR;
    }
  }

  if (status == HAL_OK)
  {
    /* Check serial interface status and mode */
    if ((hmdf->Instance->SITFCR & MDF_SITFCR_SITFACTIVE) == 0U)
    {
      status = HAL_ERROR;
    }
    else
    {
      if ((hmdf->Instance->SITFCR & MDF_SITFCR_SITFMOD) != MDF_SITF_NORMAL_SPI_MODE)
      {
        status = HAL_ERROR;
      }
    }
  }

  if (status == HAL_OK)
  {
    /* Disable clock absence detection interrupt */
    hmdf->Instance->DFLTIER &= ~(MDF_DFLTIER_CKABIE);

    /* Clear potential pending clock absence detection flag */
    hmdf->Instance->DFLTISR |= MDF_DFLTISR_CKABF;
  }

  /* Return function status */
  return status;
}

/**
  * @}
  */

/** @defgroup MDF_Exported_Functions_Group4  Generic functions
  * @brief    Generic functions
  *
@verbatim
  ==============================================================================
                          ##### Generic functions #####
  ==============================================================================
    [..]  This section provides functions allowing to :
      (+) Handle MDF interrupt.
      (+) Inform user that error occurs.
      (+) Get the current MDF instance state.
      (+) Get the current MDF instance error code.
@endverbatim
  * @{
  */

/**
  * @brief  This function handles the MDF interrupts.
  * @param  hmdf MDF handle.
  * @retval None.
  */
void HAL_MDF_IRQHandler(MDF_HandleTypeDef *hmdf)
{
  uint32_t tmp_reg1;
  uint32_t tmp_reg2;
  uint32_t interrupts;

