RT-Thread/rt-thread/bsp/stm32/libraries/STM32H7RSxx_HAL/STM32H7RSxx_HAL_Driver/Src/stm32h7rsxx_hal_mdf.c
  assert_param(IS_FUNCTIONAL_STATE(pFilterConfig->SoundActivity.Activation));
  if (pFilterConfig->SoundActivity.Activation == ENABLE)
  {
    /* Configure SAD mode, frame size, hysteresis, sound trigger event
       and data memory transfer only for ADF instance */
    assert_param(IS_MDF_SAD_MODE(pFilterConfig->SoundActivity.Mode));
    assert_param(IS_MDF_SAD_FRAME_SIZE(pFilterConfig->SoundActivity.FrameSize));
    if (pFilterConfig->SoundActivity.Mode != MDF_SAD_AMBIENT_NOISE_DETECTOR)
    {
      assert_param(IS_FUNCTIONAL_STATE(pFilterConfig->SoundActivity.Hysteresis));
    }
    assert_param(IS_MDF_SAD_SOUND_TRIGGER(pFilterConfig->SoundActivity.SoundTriggerEvent));
    assert_param(IS_MDF_SAD_DATA_MEMORY_TRANSFER(pFilterConfig->SoundActivity.DataMemoryTransfer));
    if ((pFilterConfig->SoundActivity.Mode != MDF_SAD_AMBIENT_NOISE_DETECTOR) &&
        (pFilterConfig->SoundActivity.Hysteresis == ENABLE))
    {
      hmdf->Instance->SADCR = (pFilterConfig->SoundActivity.Mode | pFilterConfig->SoundActivity.FrameSize |
                               MDF_SADCR_HYSTEN | pFilterConfig->SoundActivity.SoundTriggerEvent |
                               pFilterConfig->SoundActivity.DataMemoryTransfer);
    }
    else
    {
      hmdf->Instance->SADCR = (pFilterConfig->SoundActivity.Mode | pFilterConfig->SoundActivity.FrameSize |
                               pFilterConfig->SoundActivity.SoundTriggerEvent |
                               pFilterConfig->SoundActivity.DataMemoryTransfer);
    }

    /* Configure SAD minimum noise level, hangover window, learning frames,
       ambient noise slope control and signal noise threshold only for ADF instance */
    assert_param(IS_MDF_SAD_MIN_NOISE_LEVEL(pFilterConfig->SoundActivity.MinNoiseLevel));
    assert_param(IS_MDF_SAD_HANGOVER_WINDOW(pFilterConfig->SoundActivity.HangoverWindow));
    assert_param(IS_MDF_SAD_LEARNING_FRAMES(pFilterConfig->SoundActivity.LearningFrames));
    assert_param(IS_MDF_SAD_SIGNAL_NOISE_THRESHOLD(pFilterConfig->SoundActivity.SignalNoiseThreshold));
    if (pFilterConfig->SoundActivity.Mode != MDF_SAD_SOUND_DETECTOR)
    {
      assert_param(IS_MDF_SAD_AMBIENT_NOISE_SLOPE(pFilterConfig->SoundActivity.AmbientNoiseSlope));
      hmdf->Instance->SADCFGR = ((pFilterConfig->SoundActivity.MinNoiseLevel << MDF_SADCFGR_ANMIN_Pos) |
                                 pFilterConfig->SoundActivity.HangoverWindow |
                                 pFilterConfig->SoundActivity.LearningFrames |
                                 (pFilterConfig->SoundActivity.AmbientNoiseSlope << MDF_SADCFGR_ANSLP_Pos) |
                                 pFilterConfig->SoundActivity.SignalNoiseThreshold);
    }
    else
    {
      hmdf->Instance->SADCFGR = ((pFilterConfig->SoundActivity.MinNoiseLevel << MDF_SADCFGR_ANMIN_Pos) |
                                 pFilterConfig->SoundActivity.HangoverWindow |
                                 pFilterConfig->SoundActivity.LearningFrames |
                                 pFilterConfig->SoundActivity.SignalNoiseThreshold);
    }
  }
  else
  {
    /* SAD is not used */
    hmdf->Instance->SADCR = 0U;
    hmdf->Instance->SADCFGR = 0U;
  }

  /* Update instance state */
  hmdf->State = HAL_MDF_STATE_ACQUISITION;

  /* Enable sound activity detector if needed */
  if (pFilterConfig->SoundActivity.Activation == ENABLE)
  {
    hmdf->Instance->SADCR |= MDF_SADCR_SADEN;
  }

  /* Enable filter */
  hmdf->Instance->DFLTCR |= MDF_DFLTCR_DFLTEN;
}

/**
  * @brief  This function handles DMA transfer complete callback.
  * @param  hdma DMA handle.
  * @retval None.
  */
static void MDF_DmaXferCpltCallback(DMA_HandleTypeDef *hdma)
{
  MDF_HandleTypeDef *hmdf = (MDF_HandleTypeDef *)((DMA_HandleTypeDef *)hdma)->Parent;

  /* Check if DMA in circular mode */
  if (hdma->Mode != DMA_LINKEDLIST_CIRCULAR)
  {
    hmdf->State = HAL_MDF_STATE_READY;
  }

#if (USE_HAL_MDF_REGISTER_CALLBACKS == 1)
  hmdf->AcqCpltCallback(hmdf);
#else /* USE_HAL_MDF_REGISTER_CALLBACKS */
  HAL_MDF_AcqCpltCallback(hmdf);
#endif /* USE_HAL_MDF_REGISTER_CALLBACKS */
}

/**
  * @brief  This function handles DMA half transfer complete callback.
  * @param  hdma DMA handle.
  * @retval None.
  */
static void MDF_DmaXferHalfCpltCallback(DMA_HandleTypeDef *hdma)
{
  MDF_HandleTypeDef *hmdf = (MDF_HandleTypeDef *)((DMA_HandleTypeDef *)hdma)->Parent;

#if (USE_HAL_MDF_REGISTER_CALLBACKS == 1)
  hmdf->AcqHalfCpltCallback(hmdf);
#else /* USE_HAL_MDF_REGISTER_CALLBACKS */
  HAL_MDF_AcqHalfCpltCallback(hmdf);
#endif /* USE_HAL_MDF_REGISTER_CALLBACKS */
}

/**
  * @brief  This function handles DMA error callback.
  * @param  hdma DMA handle.
  * @retval None.
  */
static void MDF_DmaErrorCallback(DMA_HandleTypeDef *hdma)
{
  MDF_HandleTypeDef *hmdf = (MDF_HandleTypeDef *)((DMA_HandleTypeDef *)hdma)->Parent;

  /* Update error code */
  hmdf->ErrorCode |= MDF_ERROR_DMA;

#if (USE_HAL_MDF_REGISTER_CALLBACKS == 1)
  hmdf->ErrorCallback(hmdf);
#else /* USE_HAL_MDF_REGISTER_CALLBACKS */
  HAL_MDF_ErrorCallback(hmdf);
#endif /* USE_HAL_MDF_REGISTER_CALLBACKS */
}

/**
  * @}
  */

#endif /* HAL_MDF_MODULE_ENABLED */

/**
  * @}
  */

/**
  * @}
  */
